{
  "home": "ana sayfa",
  "projects": "projeler",
  "stats": "istatistikler",
  "experience": "deneyim",
  "contact": "iletişim",
  "language_en": "İngilizce",
  "language_tr": "Türkçe",
  "language_es": "İspanyolca",
  "language_fr": "Fransızca",
  "menu": "Menü",
  "YIIT": "YİĞİT",
  "#": "#",
  "✕": "✕",
  "☰": "☰",
  "Hello! I'm": "Merhaba! Ben",
  "(ish)": "(vari)",
  "web developer.": "web geliştiricisiyim.",
  "Yo, my name is": "Selam, benim adım",
  "Yiğit": "Yiğit",
  "I'm a full-stack web developer from": "Ben bir full-stack web geliştiricisiyim, buradan:",
  "Turkiye": "Türkiye",
  "I'm also passionate about rap music, philosophy and science! I'm always open to new knowledge if it'll improve me in anyways.": "Ayrıca rap müziğe, felsefeye ve bilime tutkuluyum! Beni geliştirecek her türlü yeni bilgiye açığım.",
  "Contact Me!": "Bana Ulaş!",
  "I honestly dont have any images to put here": "Açıkçası buraya koyacak bir görselim yok",
  "This website, build on Vite (react), nothing fancy": "Bu site Vite (React) ile yapıldı, ekstra bir şey yok",
  "A lightweight Discord-logger minecraft plugin to keep your server safe and moderated.": "Sunucunuzu güvenli ve denetimli tutmak için hafif bir Discord-logger Minecraft eklentisi.",
  "An Instagram bot that automatically reposts reels from direct messages with automated video processing and rate limit handling.": "DM’den gönderilen reels videolarını otomatik yeniden paylaşan, video işleme ve hız limiti yönetimi yapan bir Instagram botu.",
  "A lightweight, vanilla JavaScript toast notification library for displaying user-friendly messages in web applications.": "Web uygulamalarında kullanıcı dostu mesajlar göstermek için hafif bir vanilla JavaScript bildirim kütüphanesi.",
  "A basic webhook generator panel for discord. Nothing too crazy.": "Discord için basit bir webhook oluşturma paneli. Çok karmaşık değil.",
  "[NOT-COMPLATED] Full-stack barber booking platform built with Next.js, featuring a customer booking page and a management dashboard.": "[TAMAMLANMADI] Next.js ile yapılmış, müşteri randevu sayfası ve yönetim paneli içeren full-stack berber randevu platformu.",
  "With great power comes great electricity bill": "Büyük güçle birlikte büyük elektrik faturası gelir",
  "The best way to predict the future is to invent it": "Geleceği tahmin etmenin en iyi yolu onu icat etmektir",
  "Life is 10% what happens to us and 90% how we react to it": "Hayatın %10’u başımıza gelenler, %90’ı ise onlara nasıl tepki verdiğimizdir",
  "The only limit to our realization of tomorrow is our doubts of today": "Yarının gerçekleşmesindeki tek sınır bugünkü şüphelerimizdir",
  "Success is not final, failure is not fatal: It is the courage to continue that counts": "Başarı nihai değildir, başarısızlık ölümcül değildir: Önemli olan devam etme cesaretidir",
  "The only way to do great work is to love what you do": "Harika işler yapmanın tek yolu yaptığın işi sevmektir",
  "You miss 100% of the shots you don't take": "Vurmadığın atışların %100’ünü kaçırırsın",
  "The future belongs to those who believe in the beauty of their dreams": "Gelecek, hayallerinin güzelliğine inananlarındır",
  "It does not matter how slowly you go as long as you do not stop": "Durmadığın sürece ne kadar yavaş gittiğin önemli değildir",
  "The only impossible journey is the one you never begin": "Tek imkansız yolculuk hiç başlamadığındır",
  "Believe you can and you're halfway there": "Yapabileceğine inan, yolun yarısı tamamdır",
  "Act as if what you do makes a difference. It does": "Yaptığın şeyin fark yarattığını düşünerek hareket et. Çünkü yaratır",
  "Success usually comes to those who are too busy to be looking for it": "Başarı genellikle onu arayamayacak kadar meşgul olanlara gelir",
  "Don't watch the clock; do what it does. Keep going": "Saate bakma; onun yaptığı gibi yap. Devam et",
  "You can't build a reputation on what you are going to do": "Ne yapacağını söyleyerek itibar inşa edemezsin",
  "The future depends on what you do today": "Gelecek, bugün yaptıklarına bağlıdır",
  "The best revenge is massive success": "En iyi intikam büyük başarıdır",
  "Your time is limited, so don't waste it living someone else's life": "Zamanın sınırlı, başkasının hayatını yaşayarak harcama",
  "The only way to achieve the impossible is to believe it is possible": "İmkansızı başarmanın tek yolu onun mümkün olduğuna inanmaktır",
  "Success is not how high you have climbed, but how you make a positive difference to the world": "Başarı, ne kadar yükseğe çıktığın değil, dünyada nasıl olumlu bir fark yarattığındır",
  "The only place where success comes before work is in the dictionary": "Başarının çalışmadan önce geldiği tek yer sözlüktür",
  "Success is walking from failure to failure with no loss of enthusiasm": "Başarı, hevesini kaybetmeden başarısızlıktan başarısızlığa yürümektir",
  "The way to get started is to quit talking and begin doing": "Başlamanın yolu konuşmayı bırakıp yapmaya başlamaktır",
  "Don't be afraid to give up the good to go for the great": "Daha iyisine ulaşmak için iyiyi bırakmaktan korkma",
  "If you want to achieve greatness stop asking for permission": "Büyüklüğe ulaşmak istiyorsan izin istemeyi bırak",
  "Success is not in what you have, but who you are": "Başarı sahip olduklarında değil, kim olduğundadır",
  "Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful": "Başarı mutluluğun anahtarı değildir. Mutluluk başarının anahtarıdır. Yaptığın işi seviyorsan başarılı olursun",
  "- Someone in the history probably": "- Tarihte birileri muhtemelen",
  "Software Development Intern": "Yazılım Geliştirme Stajyeri",
  "MayITC": "MayITC",
  "May 2025 - Aug 2025": "Mayıs 2025 - Ağustos 2025",
  "OOP": "NYP",
  "Agile": "Çevik",
  "Web Development": "Web Geliştirme",
  "HR": "İK",
  "Completed my first international internship in Barcelona through the EU Erasmus+ program. Gained hands-on experience in professional workflows, contributed to real projects, and continued to sharpen my development skills.": "EU Erasmus+ programı ile Barselona’da ilk uluslararası stajımı tamamladım. Profesyonel iş akışlarında deneyim kazandım, gerçek projelere katkıda bulundum ve geliştirme becerilerimi geliştirmeye devam ettim.",
  "Independent Developer": "Bağımsız Geliştirici",
  "Freelance & Personal Projects": "Freelance & Kişisel Projeler",
  "Jan 2024 - Dec 2024": "Ocak 2024 - Aralık 2024",
  "Node.js": "Node.js",
  "Discord.js": "Discord.js",
  "React": "React",
  "Hosting Services": "Hosting Servisleri",
  "Modding": "Modlama",
  "Launched several projects, including Discord bots, Minecraft mods, and hosting services. Built and maintained websites for two bridal companies, applying both technical and client-facing skills.": "Discord botları, Minecraft modları ve hosting servisleri dahil birçok proje geliştirdim. İki gelinlik şirketi için web siteleri kurdum ve yönettim, hem teknik hem müşteriyle iletişim becerilerimi kullandım.",
  "High School Student": "Lise Öğrencisi",
  "Arkas Meslek Lisesi": "Arkas Meslek Lisesi",
  "Sep 2023 - Present": "Eyl 2023 - Devam Ediyor",
  "Software Engineering Fundamentals": "Yazılım Mühendisliği Temelleri",
  "Problem Solving": "Problem Çözme",
  "Collaboration": "İşbirliği",
  "Began studies at Arkas Vocational High School, specializing in software engineering. Balanced coursework with personal development and freelance projects.": "Arkas Meslek Lisesi’nde yazılım mühendisliği üzerine eğitimime başladım. Derslerimi, kişisel gelişimimi ve freelance projelerimi dengeledim.",
  "Freelance Web Developer": "Freelance Web Geliştirici",
  "Self-Employed": "Kendi İşim",
  "[I DONT REMEMBER THE DATES]": "[TARİHLERİ HATIRLAMIYORUM]",
  "HTML": "HTML",
  "CSS": "CSS",
  "JavaScript": "JavaScript",
  "Freelancing": "Freelance",
  "Started building websites independently and took on freelance projects through Fiverr, delivering solutions to real clients and learning to manage end-to-end development.": "Kendi başıma web siteleri yapmaya başladım ve Fiverr üzerinden freelance projeler aldım, gerçek müşterilere çözümler sundum ve baştan sona geliştirme sürecini yönetmeyi öğrendim.",
  "Hobby Developer": "Hobi Geliştirici",
  "Self-Learning": "Kendi Kendine Öğrenme",
  "Sep 2021 - []": "Eyl 2021 - []",
  "Bot Development": "Bot Geliştirme",
  "Discovered coding as a hobby by creating Discord bots using Node.js and Discord.js, which sparked my passion for programming.": "Node.js ve Discord.js kullanarak Discord botları yaparak programlamayı bir hobi olarak keşfettim ve yazılım tutkum başladı.",
  "Made with ❤ by Yiğit": "Yiğit tarafından ❤ ile yapıldı",
  "©": "©",
  "All rights reserved.": "Tüm hakları saklıdır.",
  "I'm always open to new opportunities and collaborations. If you have a project in mind, want to discuss web development, or just want to say hi, feel free to reach out!": "Her zaman yeni fırsatlara ve işbirliklerine açığım. Eğer aklında bir proje varsa, web geliştirme hakkında konuşmak ya da sadece selam vermek istiyorsan, bana ulaşabilirsin!",
  "Find me @": "Beni bul:",
  "yiitwt": "yiitwt",
  "[OUT OF ORDER]": "[KAPALI]",
  "yiit_locked": "yiit_locked",
  "contact@yiit.xyz": "contact@yiit.xyz",
  "My Stats": "İstatistiklerim",
  "Age: ": "Yaş: ",
  "Gender: Male": "Cinsiyet: Erkek",
  "Location: Turkiye": "Konum: Türkiye",
  "Experience: ": "Deneyim: ",
  "Projects: 20+": "Projeler: 20+",
  "Commits: 100+": "Commit: 100+",
  "Languages": "Diller",
  "Tools": "Araçlar",
  "Frameworks": "Çatılar",
  "Database": "Veritabanı"
}
